In [ ]:
%load tutorial.db [rw]

In [ ]:
select * from sales

+---------+------------+------+----------+-------+
| sale_id | product_id | year | quantity | price |
+---------+------------+------+----------+-------+
| 1       | 100        | 2008 | 10       | 5000  |
+---------+------------+------+----------+-------+
| 2       | 100        | 2009 | 12       | 5000  |
+---------+------------+------+----------+-------+
| 7       | 200        | 2011 | 15       | 9000  |
+---------+------------+------+----------+-------+

In [ ]:
select * from product

+------------+--------------+
| product_id | product_name |
+------------+--------------+
| 100        | Nokia        |
+------------+--------------+
| 200        | Apple        |
+------------+--------------+
| 300        | Samsung      |
+------------+--------------+

## Write a solution to select the product id, year, quantity, and price for the first year of every product sold.

In [ ]:
select product_id, min(year) first_year, quantity, price from sales group by product_id

+------------+------------+----------+-------+
| product_id | first_year | quantity | price |
+------------+------------+----------+-------+
| 100        | 2008       | 10       | 5000  |
+------------+------------+----------+-------+
| 200        | 2011       | 15       | 9000  |
+------------+------------+----------+-------+

this will hit ORA-979 error because quantity has 2 rows and product_id has one after groupby. can use group function as what is done for the year column to avoid this error.

In [ ]:
select min(year) first_year from sales group by product_id

+------------+
| first_year |
+------------+
| 2008       |
+------------+
| 2011       |
+------------+

In [ ]:
with t as (
    select product_id, min(year) first_year from sales group by product_id
)

select s.product_id, s.year first_year, s.quantity, s.price
from sales s, t
where s.product_id=t.product_id and s.year=t.first_year

+------------+------------+----------+-------+
| product_id | first_year | quantity | price |
+------------+------------+----------+-------+
| 100        | 2008       | 10       | 5000  |
+------------+------------+----------+-------+
| 200        | 2011       | 15       | 9000  |
+------------+------------+----------+-------+